First deal with the imports. Import pandas and numpy. Use the shortcut/alias names to be easier, and these are universally written this way.

In [1]:
import pandas as pd
import numpy as np

Below, we are importing a list of integers. In this case, it might be grades for a test. Here we use the Pandas library (pd) to create a Pandas object called a _Series_.

In [2]:
series_a = pd.Series([90,85,88,86,91,79,82,65,88,87,96])

If you are familiar with tabular data (CSV, Excel, Google Sheets, etc.) a series is similar to a single column. Similar in that it has a single column of values, but automatically assigns an index to the values as well. This is SUPER important - Pandas LOVES a good index.

In [3]:
series_a

0     90
1     85
2     88
3     86
4     91
5     79
6     82
7     65
8     88
9     87
10    96
dtype: int64

Pandas provides some methods to series. Here we can easily calculate the mean and median.

In [4]:
print series_a.mean()
print series_a.median()

85.1818181818
87.0

_really awesome_

You can even drop duplicate values. If you are curious about what is available to you, press `tab` after the series name and see the methods available. This is the .drop_duplicates() method. It will drop any entries whose values have already been represented above it. Notice that the second 88 is dropped?

In [5]:
series_a.drop_duplicates()

0     90
1     85
2     88
3     86
4     91
5     79
6     82
7     65
9     87
10    96
dtype: int64

For the most part, unless you say specifically, the functions are not destructive. Even though we dropped the duplicates, they're still in there when we call the Series.

In [6]:
series_a

0     90
1     85
2     88
3     86
4     91
5     79
6     82
7     65
8     88
9     87
10    96
dtype: int64

Let's assign some usernames. First establish a list. Then, like before, we pass that list to Pandas and create a Series:

In [7]:
student_names = pd.Series(['WHARTNE','PTROUGH','JPERTWE','TBAKER','PDAVISO','CBAKER',
                 'SMCCOY','PMCGANN','CECCLES','DTENNAN','MSMITH','PCAPALD'])

Also, like before, Pandas has assigned an index to our list.

In [8]:
student_names

0     WHARTNE
1     PTROUGH
2     JPERTWE
3      TBAKER
4     PDAVISO
5      CBAKER
6      SMCCOY
7     PMCGANN
8     CECCLES
9     DTENNAN
10     MSMITH
11    PCAPALD
dtype: object

By using dictionaries (another python object) we can concatenate two series together on a specific axis, and name the columns at the same time. Below, we are creating an object called a DataFrame from two Series. Simply put, a DataFrame is a Series of one or more Series. In this case, we are aligning them as columns next to each other, so we are saying axis = 1.

_I think it would be good to give dictionaries their own little time here. This is python's hashable datatype, and most beginner's code could be made way more efficient by using dictionaries properly, rather than lists of lists and trying to keep track of indicies._

In [12]:
grades = pd.concat({'Names':student_names, 'Midterm':series_a}, axis=1)
grades
# grades.transpose().sort_index(ascending=False)

    Midterm    Names
0        90  WHARTNE
1        85  PTROUGH
2        88  JPERTWE
3        86   TBAKER
4        91  PDAVISO
5        79   CBAKER
6        82   SMCCOY
7        65  PMCGANN
8        88  CECCLES
9        87  DTENNAN
10       96   MSMITH
11      NaN  PCAPALD

If you are confused about **axis=0** vs. **axis=1**, watch what happens when we .concat() on **axis=0**:

In [10]:
axisTest = pd.concat([series_a, student_names], axis=0)
axisTest

0          90
1          85
2          88
3          86
4          91
5          79
6          82
7          65
8          88
9          87
10         96
0     WHARTNE
1     PTROUGH
2     JPERTWE
3      TBAKER
4     PDAVISO
5      CBAKER
6      SMCCOY
7     PMCGANN
8     CECCLES
9     DTENNAN
10     MSMITH
11    PCAPALD
dtype: object

I like to think of axis=0 as being vertical - you are adding rows to a Series or Dataframe at the bottom of the current object. By contrast, axis=1 is horizontal. You are adding columns to the right of the current object. *I hope that didn't confuse matters further.*

When concatenating Series into a DataFrame, Pandas will do its best to align them by the index. In this case, however, we have more names than grades. Pandas and NumPy know this, and added a 'NaN' where data was missing. 'NaN' is NumPy's way of saying there is **N**ot **a** **N**umber here, and should be recognized as being invalid.

To correct this cell, it should be a simple matter of providing the coordinates of the cell, and assigning the value.

..._well, it should be easy..._

In [14]:
grades[1,11] = 85
grades

    Midterm    Names  (1, 11)
0        90  WHARTNE       85
1        85  PTROUGH       85
2        88  JPERTWE       85
3        86   TBAKER       85
4        91  PDAVISO       85
5        79   CBAKER       85
6        82   SMCCOY       85
7        65  PMCGANN       85
8        88  CECCLES       85
9        87  DTENNAN       85
10       96   MSMITH       85
11      NaN  PCAPALD       85

Since we did not format the cell coordinates correctly, Pandas assumed that we were creating a new column and setting its values to the grade specified. That obviously didn't work, so let's delete it using the drop method. Be sure to specify the axis, in case you have a row named the same as one of your columns (hey, it's possible). Also, let's reassign the edited DataFrame back to itself. Otherwise, the drop function just returns a **view** of the grades DataFrame with the column dropped, without actually dropping it.

In [15]:
grades = grades.drop((1,11),axis=1)

In [16]:
grades

    Midterm    Names
0        90  WHARTNE
1        85  PTROUGH
2        88  JPERTWE
3        86   TBAKER
4        91  PDAVISO
5        79   CBAKER
6        82   SMCCOY
7        65  PMCGANN
8        88  CECCLES
9        87  DTENNAN
10       96   MSMITH
11      NaN  PCAPALD

Now, let's look at ways to index into a Series and DataFrame. There are three indexing methods:
- .ix[]
- .loc[]
- .iloc[]

The first, .ix[] is the most friendly. It will first attempt to look up what you provide as a string, and if it can't find the string, look up based upon integer.

_Is this accurate? I thought ix was just for "index x", and if you provided any secondary stuff it would try to pull out the right column. Maybe that is what you are saying, but didn't write down that the first number is just the x (row) index_

In [23]:
grades.ix[7]

Midterm         65
Names      PMCGANN
Name: 7, dtype: object

We have used the .ix[] and supplied the row with the index 7, and the column 'Midterm'. For now, something like this is as simple as we need to be. We will DEFINITELY be coming back to this...

In the meantime, let's fill that space with a grade using '=', the assignment operator.

In [24]:
grades.ix[11,'Midterm'] = 85

Checking the DataFrame, we can see that the grade is in the right place.

In [25]:
grades

    Midterm    Names
0        90  WHARTNE
1        85  PTROUGH
2        88  JPERTWE
3        86   TBAKER
4        91  PDAVISO
5        79   CBAKER
6        82   SMCCOY
7        65  PMCGANN
8        88  CECCLES
9        87  DTENNAN
10       96   MSMITH
11       85  PCAPALD

We can also check the datatypes of the variables thus far:

In [26]:
type(series_a)

pandas.core.series.Series

In [27]:
type(grades)

pandas.core.frame.DataFrame

The .info() method provides a little more detail about the object. In this case, we'll look at the grades DataFrame.

In [28]:
grades.info() # this is cool i did not know about this

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12 entries, 0 to 11
Data columns (total 2 columns):
Midterm    12 non-null float64
Names      12 non-null object
dtypes: float64(1), object(1)
memory usage: 288.0+ bytes

We can see information about the column heads.

In [29]:
grades.columns

Index([u'Midterm', u'Names'], dtype='object')

Here is some statistical information about the numerical column(s).

In [30]:
grades.describe() # this is super helpful.

         Midterm
count  12.000000
mean   85.166667
std     7.685090
min    65.000000
25%    84.250000
50%    86.500000
75%    88.500000
max    96.000000

Masking
--
Masking is a way of hiding (or showing) cells based upon a Series/DataFrame of boolean (True/False) values. It is a very powerful way to do queries, provided you are willing to do a little work on the front end.

Perhaps, we want to see every row where the 'Midterm' is greater than 85.

In [40]:
grade_threshold = 85
grades['Midterm'] > grade_threshold

0      True
1     False
2      True
3      True
4      True
5     False
6     False
7     False
8      True
9      True
10     True
11    False
Name: Midterm, dtype: bool

We can also assign this list of boolean values to a variable, and use it as a mask.

In [41]:
b_threshold = grades['Midterm'] > grade_threshold
grades[b_threshold]

    Midterm    Names
0        90  WHARTNE
2        88  JPERTWE
3        86   TBAKER
4        91  PDAVISO
8        88  CECCLES
9        87  DTENNAN
10       96   MSMITH

_You can also use masking back on the data frame to get out information you care about like the names_

_note how the thing is the braketes is evaluated as a list of booleans that is applied to the column in the df_

In [42]:
grades['Names'][grades['Midterm'] > grade_threshold]

0     WHARTNE
2     JPERTWE
3      TBAKER
4     PDAVISO
8     CECCLES
9     DTENNAN
10     MSMITH
Name: Names, dtype: object

Let's add some more grades into this class. We'll use the NumPy random integer method...

In [43]:
np.random.randint(69,high=100,size=12)

array([72, 92, 83, 85, 76, 99, 83, 75, 76, 74, 88, 95])

...and assign it to the final variable. Don't worry if your numbers look different. Each time this page is re-run, the random number generator will create a new list. In fact, this second execution is different from the first. See?

In [44]:
final = pd.Series(np.random.randint(69,high=100,size=12))

In [45]:
final

0     74
1     82
2     84
3     72
4     97
5     90
6     79
7     70
8     72
9     95
10    85
11    91
dtype: int64

Now, let's use the .concat() method to concatenate the grades DataFrame with the final Series on axis 1. We'll go ahead and explicitly name the columns as well.

In [46]:
grades_final = pd.concat([grades,final],axis=1)
grades_final.columns = ['Midterm','Names','Final']

In [47]:
grades_final

    Midterm    Names  Final
0        90  WHARTNE     74
1        85  PTROUGH     82
2        88  JPERTWE     84
3        86   TBAKER     72
4        91  PDAVISO     97
5        79   CBAKER     90
6        82   SMCCOY     79
7        65  PMCGANN     70
8        88  CECCLES     72
9        87  DTENNAN     95
10       96   MSMITH     85
11       85  PCAPALD     91

The index on the left doesn't make much sense in the context of the grades, so let's make the index equal to the names, and reassign to the grades_final DataFrame.

In [48]:
grades_final = grades_final.set_index('Names')

In [49]:
grades_final

         Midterm  Final
Names
WHARTNE       90     74
PTROUGH       85     82
JPERTWE       88     84
TBAKER        86     72
PDAVISO       91     97
CBAKER        79     90
SMCCOY        82     79
PMCGANN       65     70
CECCLES       88     72
DTENNAN       87     95
MSMITH        96     85
PCAPALD       85     91

Now, let's add another column to the DataFrame, averaging the values in each row.

In [50]:
grades_final['Avg.'] = grades_final.mean(axis=1)
grades_final

         Midterm  Final  Avg.
Names
WHARTNE       90     74  82.0
PTROUGH       85     82  83.5
JPERTWE       88     84  86.0
TBAKER        86     72  79.0
PDAVISO       91     97  94.0
CBAKER        79     90  84.5
SMCCOY        82     79  80.5
PMCGANN       65     70  67.5
CECCLES       88     72  80.0
DTENNAN       87     95  91.0
MSMITH        96     85  90.5
PCAPALD       85     91  88.0

Now, let's make a mask **in place**, getting every average greater than some grade.

In [51]:
grades_final[grades_final['Avg.']>85]

         Midterm  Final  Avg.
Names
JPERTWE       88     84  86.0
PDAVISO       91     97  94.0
DTENNAN       87     95  91.0
MSMITH        96     85  90.5
PCAPALD       85     91  88.0

We're not limited to built-in functions for extra cells, we can even make a weighted average for the two grades:

In [52]:
grades_final['W.Avg.'] = (grades_final['Midterm'] *.4 + grades_final['Final'] *.6)
grades_final

         Midterm  Final  Avg.  W.Avg.
Names
WHARTNE       90     74  82.0    80.4
PTROUGH       85     82  83.5    83.2
JPERTWE       88     84  86.0    85.6
TBAKER        86     72  79.0    77.6
PDAVISO       91     97  94.0    94.6
CBAKER        79     90  84.5    85.6
SMCCOY        82     79  80.5    80.2
PMCGANN       65     70  67.5    68.0
CECCLES       88     72  80.0    78.4
DTENNAN       87     95  91.0    91.8
MSMITH        96     85  90.5    89.4
PCAPALD       85     91  88.0    88.6

Using a boolean AND (&) or a boolean OR (|) we can combine masks to have compound results.

In [53]:
grades_final[(grades_final['Avg.'] > 85) & (grades_final['Midterm'] > 80)]

         Midterm  Final  Avg.  W.Avg.
Names
JPERTWE       88     84  86.0    85.6
PDAVISO       91     97  94.0    94.6
DTENNAN       87     95  91.0    91.8
MSMITH        96     85  90.5    89.4
PCAPALD       85     91  88.0    88.6